src/tests/data/g4s.cbgrn/get_events-004-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  get_event:
    * start: 2014-01-04T00:00:00 (UTC)
    * end:   2014-01-09T00:00:00 (UTC)

  response:
    * no attributes (error)
-->
<soap:Envelope
  xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <Action
      soap:mustUnderstand="1"
      xmlns="http://schemas.xmlsoap.org/ws/2003/03/addressing">
      ScheduleGetEvents
    </Action>
    <Timestamp
      soap:mustUnderstand="1"
      Id="id"
      xmlns="http://schemas.xmlsoap.org/ws/2002/07/utility">
      <Created>2014-01-01T00:00:00Z</Created>
      <Expires>2014-01-02T00:00:00Z</Expires>
    </Timestamp>
    <Security soap:mustUnderstand="1">
      <UsernameToken>
        <Username>foo</Username>
        <Password>bar</Password>
      </UsernameToken>
    </Security>
    <Locale>en</Locale>
  </soap:Header>
  <soap:Body>
    <ScheduleGetEvents xmlns="http://wsdl.cybozu.co.jp/base/2008">
      <parameters start="2014-01-04T00:00:00Z" end="2014-01-09T00:00:00Z"/>
    </ScheduleGetEvents>
  </soap:Body>
</soap:Envelope>